 #+BEGIN_COMMENT
.. title: Python with Org-Babel
.. slug: python-with-org-babel
.. date: 2016-12-28 14:12:41 UTC-08:00
.. tags: how-to,python,babel,literate programming
.. category: HowTo
.. link: 
.. description: Using org-babel with python.
.. type: text
#+END_COMMENT

* Main functions
The *Code Like a Pythonista* template expects that you are creating a command-line executable with a *main* entry-point. This section implements that case as an example.

First the =<<literate-main-imports>>=.

#+name: literate-main-imports
#+begin_src python
  from argparse import ArgumentParser
#+end_src

Now the =<<literate-main>>=.

#+name: literate-main
#+begin_src python
    def main():
        parser = ArgumentParser(description="literate caller")
        parser.add_argument("-w", "--who", type=str,
                            default="me", help="who are you?")
        args = parser.parse_args()
        who = args.who
        thing = LiterateClass(who)
        thing()
        return 0
#+end_src

As a quick check we can run the code at the command line to see that it's working (the main block has to be tangled for this to work).
#+name: bashrun-main
#+begin_src sh :results output :exports both
python literate_python/literate.py --who "Not Me"
#+end_src

#+RESULTS: bashrun-main
: Who: Not Me

*** Running the doctests
    Now we can actually run them with python to see what happens.
#+name: run-doctest
#+begin_src sh :results output :exports both
python -m doctest literate_python/test_literate_output.doctest
true
#+end_src

#+RESULTS: run-doctest
#+begin_example
**********************************************************************
File "literate_python/test_literate_output.doctest", line 9, in test_literate_output.doctest
Failed example:
    bad_thing()
Expected:
    Who: Magilla Gorilla
Got:
    Who: Gorilla Glue
**********************************************************************
1 items had failures:
   1 of   5 in test_literate_output.doctest
***Test Failed*** 1 failures.
#+end_example

Note that since this returned a non-zero exit code (I think) you need to put =true= in the code block or there would be no output.

*** Running the test
    One important thing to note is that this will put an error message in a separate buffer if something goes wrong (like you don't have py.test installed), which in at least some cases makes it look like it failed silently. Unlike with the doctests, no output means something in the setup needs to be fixed, so you should tangle the file and then run it at the command-line to debug what happened.
#+name: shell-run-pytest
#+begin_src sh :results output :exports both
py.test -v literate_python/testliterate.py
#+end_src

#+RESULTS: shell-run-pytest
#+begin_example
============================= test session starts ==============================
platform linux -- Python 3.5.1+, pytest-3.0.5, py-1.4.32, pluggy-0.4.0 -- /home/cronos/.virtualenvs/nikola/bin/python3
cachedir: .cache
rootdir: /home/cronos/projects/nikola/posts, iniimg-url: 
plugins: faker-2.0.0, bdd-2.18.1
collecting ... collected 1 items

literate_python/testliterate.py::test_constructor PASSED

=========================== 1 passed in 0.04 seconds ===========================
#+end_example
